src/DataProcessors/Демо_КОД_Обработчик_ОтправительСообщенияВОчередь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>Демо_КОД_Обработчик_ОтправительСообщенияВОчередь</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/Демо_КОД_ИсходящаяОчередьСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Демо_КОД_ИсходящаяОчередьСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заголовки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/Демо_КОД_Обработчик_ОтправительСообщенияВОчередь/Ext/ObjectModule.bsl
#Область ОписаниеПеременных

Перем СледующийОбработчик;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает сведения о внешней обработке для регистрации в подсистеме
// дополнительных отчетов и обработок.
//
// Возвращаемое значение:
//  Структура - параметры регистрации внешней обработки.
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	//ПараметрыРегистрации =
	//	ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(
	//		СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	//
	//ПараметрыРегистрации.Вид =
	//	ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	//ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	//ПараметрыРегистрации.Версия = "1.0";
	//
	//Возврат ПараметрыРегистрации;
	
КонецФункции

// Устанавливает следующий обработчик цепочки или возвращает ранее установленный.
//
// Параметры:
//  Обработчик - ОбработкаОбъект, Неопределено - следующий обработчик цепочки.
//
// Возвращаемое значение:
//  ОбработкаОбъект, Неопределено - следующий обработчик цепочки.
Функция Следующий(Обработчик = Неопределено) Экспорт
	
	Если Обработчик <> Неопределено Тогда
		СледующийОбработчик = Обработчик;
	КонецЕсли;
	
	Возврат СледующийОбработчик;
	
КонецФункции

// Записывает сообщения для всех получателей во внутреннюю исходящую очередь.
//
// Параметры:
//  Контекст - ФиксированнаяСтруктура - контекст выполнения конвейера.
//  Вход - ФиксированнаяСтруктура, Неопределено - подготовленное сообщение.
Процедура Обработать(Контекст, Вход = Неопределено) Экспорт
	
	Если Вход = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаборОчереди = РегистрыСведений.Демо_КОД_ИсходящаяОчередьСообщений.СоздатьНаборЗаписей();
	
	Для Каждого Получатель Из Вход.Получатели Цикл
		
		ЗаписьОчередь = НаборОчереди.Добавить();
		ЗаписьОчередь.Отправитель = КодЭтогоУзлаПоУзлуПланаОбмена(Получатель);
		ЗаписьОчередь.ТипОперации = Вход.Заголовки["sync_type"];
		ЗаписьОчередь.Заголовки = ЗаписатьJSON_(Вход.Заголовки);
		ЗаписьОчередь.МоментВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьОчередь.Идентификатор = Новый УникальныйИдентификатор;
		ЗаписьОчередь.ДатаВремя = ТекущаяДата();
		ЗаписьОчередь.Получатель = Получатель.Код;
		ЗаписьОчередь.ТипСообщения = Контекст.Вход.ОбъектМетаданных.ПолноеИмя();
		ЗаписьОчередь.ТелоСообщения = Вход.Тело;
		
	КонецЦикла;
	
	Если НаборОчереди.Количество() > 0 Тогда
		НаборОчереди.Записать(Ложь);
	КонецЕсли;
	
	ПередатьДругому(Контекст, Вход);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КодЭтогоУзлаПоУзлуПланаОбмена(Узел) Экспорт
	
	Возврат ПолучитьКодЭтогоУзлаДляПланаОбмена(Узел.Метаданные().Имя);
	
КонецФункции

Функция ПолучитьКодЭтогоУзлаДляПланаОбмена(ИмяПланаОбмена) Экспорт
	
	Возврат ПолучитьЭтотУзелПланаОбмена(ИмяПланаОбмена).Код;
	
КонецФункции

Функция ПолучитьЭтотУзелПланаОбмена(ИмяПланаОбмена) Экспорт
	
	Возврат ПланыОбмена[ИмяПланаОбмена].ЭтотУзел();
	
КонецФункции

Функция ЗаписатьJSON_(Значение, ПараметрыЗаписи = Неопределено)
	
	Если ПараметрыЗаписи = Неопределено Тогда
		ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(ЗаписьJSON, Значение, , "ПреобразованиеJSON", ЭтотОбъект);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ПреобразованиеJSON(Знач Свойство, Значение, ДопПараметры, Отказ) Экспорт
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

// Передает управление следующему обработчику цепочки.
//
// Параметры:
//  Контекст - ФиксированнаяСтруктура - контекст выполнения конвейера.
//  Выход - Произвольный - результат текущего обработчика.
Процедура ПередатьДругому(Контекст, Выход = Неопределено)
		
	Если СледующийОбработчик = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СледующийОбработчик.Обработать(Контекст, Выход);
	
КонецПроцедуры

#КонецОбласти
